CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    AMI1
    {
        type            patch;
        nFaces          1200;
        startFace       71750;
    }
    AMI2
    {
        type            patch;
        nFaces          1000;
        startFace       72950;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       73950;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       73990;
    }
    train
    {
        type            wall;
        inGroups        1(wall);
        nFaces          620;
        startFace       74030;
    }
    outside
    {
        type            patch;
        nFaces          1000;
        startFace       74650;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          600;
        startFace       75650;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          37000;
        startFace       76250;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          37000;
        startFace       113250;
    }
)

// ************************************************************************* //
