CFD/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    trains
    {
        type            movingWallVelocity;
        value           $internalField;
    }
    outside
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    #include "include/frontBackPatches"


    AMI1
    {
        type            cyclicACMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicACMI;
        value           $internalField;
    }
}

// ************************************************************************* //
